server/app/controllers/playlists_controller.rb

SELECT "playlists".* FROM "playlists"
---
    def index
        render json: Playlist.all

INSERT INTO "playlists" ("name", "my_playlist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Under The Sun (with J. Cole & Lute feat. DaBaby)"], ["my_playlist_id", 1], ["created_at", "2019-07-12 15:59:35.999502"], ["updated_at", "2019-07-12 15:59:35.999502"]]
---
    def new
        Playlist.create(name: playlist_params["name"], my_playlist_id: playlist_params["my_playlist_id"])